---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.GetKeys
source: html/d1d6c5e4-3fa0-cbd6-a1cf-10286541ade8.htm
---
# Autodesk.Revit.DB.ExportLayerTable.GetKeys Method

Gets all the keys stored in the map.

## Syntax (C#)
```csharp
public IList<ExportLayerKey> GetKeys()
```

## Returns
Return the key array.